{
	"articles":[
	{
		"title": "Internet of Things",
		"imageLink": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Internet_of_things_signed_by_the_author.jpg/400px-Internet_of_things_signed_by_the_author.jpg", 
		"description":"The Internet of Things (IoT) is the network of physical objects—devices, vehicles, buildings and other items—embedded with electronics, software, sensors, and network connectivity that enables these objects to collect and exchange data.[1] The IoT allows objects to be sensed and controlled remotely across existing network infrastructure,[2] creating opportunities for more direct integration of the physical world into computer-based systems, and resulting in improved efficiency, accuracy and economic benefit;[3][4][5][6][7][8] when IoT is augmented with sensors and actuators, the technology becomes an instance of the more general class of cyber-physical systems, which also encompasses technologies such as smart grids, smart homes, intelligent transportation and smart cities. Each thing is uniquely identifiable through its embedded computing system but is able to interoperate within the existing Internet infrastructure. Experts estimate that the IoT will consist of almost 50 billion objects by 2020.[9]"
	},
        {
		"title": "8 ways the Internet of things will change the way we live and work",
		"imageLink": "http://blogs.cisco.com/wp-content/uploads/Marie_hattar_2_3.jpg", 
		"description":"By 2020, there will be tens of billions of data-spouting devices connected to the Internet. And they're already changing how we live and work"
	},{
		"title": "Applications for the Internet of Things",
		"imageLink": "http://www.theinquirer.net/IMG/691/306691/smart-home-internet-of-things.jpg", 
		"description":"According to Gartner, Inc. (a technology research and advisory corporation), there will be nearly 26 billion devices on the Internet of Things by 2020.[38] ABI Research estimates that more than 30 billion devices will be wirelessly connected to the Internet of Things by 2020.[39] As per a recent survey and study done by Pew Research Internet Project, a large majority of the technology experts and engaged Internet users who responded—83 percent—agreed with the notion that the Internet/Cloud of Things, embedded and wearable computing (and the corresponding dynamic systems[40]) will have widespread and beneficial effects by 2025.[41] As such, it is clear that the IoT will consist of a very large number of devices being connected to the Internet.[42] In an active move to accommodate new and emerging technological innovation, the UK Government, in their 2015 budget, allocated £40,000,000 towards research into the Internet of Things. The British Chancellor of the Exchequer George Osborne, posited that the Internet of Things is the next stage of the information revolution and referenced the inter-connectivity of everything from urban transport to medical devices to household appliances.[43]

Integration with the Internet implies that devices will use an IP address as a unique identifier. However, due to the limited address space of IPv4 (which allows for 4.3 billion unique addresses), objects in the IoT will have to use IPv6 to accommodate the extremely large address space required.[44][45][46][47][48] Objects in the IoT will not only be devices with sensory capabilities, but also provide actuation capabilities (e.g., bulbs or locks controlled over the Internet).[49] To a large extent, the future of the Internet of Things will not be possible without the support of IPv6; and consequently the global adoption of IPv6 in the coming years will be critical for the successful development of the IoT in the future.[45][46][47][48]

The ability to network embedded devices with limited CPU, memory and power resources means that IoT finds applications in nearly every field.[50] Such systems could be in charge of collecting information in settings ranging from natural ecosystems to buildings and factories,[49] thereby finding applications in fields of environmental sensing and urban planning.[51]
On the other hand, IoT systems could also be responsible for performing actions, not just sensing things. Intelligent shopping systems, for example, could monitor specific users' purchasing habits in a store by tracking their specific mobile phones. These users could then be provided with special offers on their favorite products, or even location of items that they need, which their fridge has automatically conveyed to the phone.[52][53] Additional examples of sensing and actuating are reflected in applications that deal with heat, electricity and energy management, as well as cruise-assisting transportation systems.[54] Other applications that the Internet of Things can provide is enabling extended home security features and home automation. The concept of an "internet of living things" has been proposed to describe networks of biological sensors that could use cloud-based analyses to allow users to study DNA or other molecules.[55] All these advances add to the numerous list of IoT applications. Now with IoT, you can control the electrical devices installed in your house while you are sorting out your files in office. Your water will be warm as soon as you get up in the morning for the shower. All credit goes to smart devices which make up the smart home. Everything connected with the help of Internet.[56]

However, the application of the IoT is not only restricted to these areas. Other specialized use cases of the IoT may also exist. An overview of some of the most prominent application areas is provided here. Based on the application domain, IoT products can be classified broadly into five different categories: smart wearable, smart home, smart city, smart environment, and smart enterprise. The IoT products and solutions in each of these markets have different characteristics.[57]
"
	}
	] 
}

