{
	"articles":[
	{
		"title": "Internet of Things",
		"imageLink": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Internet_of_things_signed_by_the_author.jpg/400px-Internet_of_things_signed_by_the_author.jpg", 
		"description":"The Internet of Things (IoT) is the network of physical objects—devices, vehicles, buildings and other items—embedded with electronics, software, sensors, and network connectivity that enables these objects to collect and exchange data.[1] The IoT allows objects to be sensed and controlled remotely across existing network infrastructure,[2] creating opportunities for more direct integration of the physical world into computer-based systems, and resulting in improved efficiency, accuracy and economic benefit;[3][4][5][6][7][8] when IoT is augmented with sensors and actuators, the technology becomes an instance of the more general class of cyber-physical systems, which also encompasses technologies such as smart grids, smart homes, intelligent transportation and smart cities. Each thing is uniquely identifiable through its embedded computing system but is able to interoperate within the existing Internet infrastructure. Experts estimate that the IoT will consist of almost 50 billion objects by 2020.[9]"
	},
        {
		"title": "The Internet of Things: Roadmap to a Connected World",
		"imageLink": "http://blogs.cisco.com/wp-content/uploads/Marie_hattar_2_3.jpg", 
		"description":"What if every vehicle, home appliance, heating system and light switch were connected to the Internet? Today, that’s not such a stretch of the imagination. Modern cars, for instance, already have hundreds of sensors and multiple computers connected over an internal network. And that’s just one example of the 6.4 billion connected “things” in use worldwide this year, according to research by Gartner Inc. DHL and Cisco Systems offer even higher estimates—their 2015 Trend Report sets the current number of connected devices at about 15 billion, amidst industry expectations that the tally will increase to 50 billion by 2020.The Internet of Things (IoT)—a sophisticated network of objects embedded with electronic systems that enable them to collect and exchange data—is disrupting technology and changing the way we live. Fewer than two decades ago, if I’d predicted that the IoT would transform the auto-rental industry, people would have laughed. Yet here we are now in the age of Zipcar. By pioneering a range of connected technologies, the car-sharing company has unlocked greater convenience for customers and kick-started the sharing economy. Now the functionality of IoT-enabled cars is transforming the auto industry—from the ultra-connected Tesla to Google’s self-driving cars—and Uber hopes one day to chauffeur you to your destination in an autonomous vehicle."
	},{
		"title": "Applications for the Internet of Things",
		"imageLink": "http://www.theinquirer.net/IMG/691/306691/smart-home-internet-of-things.jpg", 
		"description":"According to Gartner, Inc. (a technology research and advisory corporation), there will be nearly 26 billion devices on the Internet of Things by 2020.[38] ABI Research estimates that more than 30 billion devices will be wirelessly connected to the Internet of Things by 2020.[39] As per a recent survey and study done by Pew Research Internet Project, a large majority of the technology experts and engaged Internet users who responded—83 percent—agreed with the notion that the Internet/Cloud of Things, embedded and wearable computing (and the corresponding dynamic systems[40]) will have widespread and beneficial effects by 2025.[41] As such, it is clear that the IoT will consist of a very large number of devices being connected to the Internet.[42] In an active move to accommodate new and emerging technological innovation, Integration with the Internet implies that devices will use an IP address as a unique identifier. However, due to the limited address space of IPv4 (which allows for 4.3 billion unique addresses), objects in the IoT will have to use IPv6 to accommodate the extremely large address space required.[44][45][46][47][48] Objects in the IoT will not only be devices with sensory capabilities, but also provide actuation capabilities (e.g., bulbs or locks controlled over the Internet).[49] To a large extent, the future of the Internet of Things will not be possible without the support of IPv6; and consequently the global adoption of IPv6 in the coming years will be critical for the successful development of the IoT in the future.[45][46][47][48]"
	}
	] 
}

